Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_3 (InputLayer)            (None, 768, 768, 3)  0
__________________________________________________________________________________________________
conv_1 (Conv2D)                 (None, 768, 768, 32) 864         input_3[0][0]
__________________________________________________________________________________________________
norm_1 (BatchNormalization)     (None, 768, 768, 32) 128         conv_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 768, 768, 32) 0           norm_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 384, 384, 32) 0           leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
conv_2 (Conv2D)                 (None, 384, 384, 64) 18432       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
norm_2 (BatchNormalization)     (None, 384, 384, 64) 256         conv_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 384, 384, 64) 0           norm_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 192, 192, 64) 0           leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
conv_3 (Conv2D)                 (None, 192, 192, 128 73728       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
norm_3 (BatchNormalization)     (None, 192, 192, 128 512         conv_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 192, 192, 128 0           norm_3[0][0]
__________________________________________________________________________________________________
conv_4 (Conv2D)                 (None, 192, 192, 64) 8192        leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
norm_4 (BatchNormalization)     (None, 192, 192, 64) 256         conv_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 192, 192, 64) 0           norm_4[0][0]
__________________________________________________________________________________________________
conv_5 (Conv2D)                 (None, 192, 192, 128 73728       leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
norm_5 (BatchNormalization)     (None, 192, 192, 128 512         conv_5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 192, 192, 128 0           norm_5[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 96, 96, 128)  0           leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
conv_6 (Conv2D)                 (None, 96, 96, 256)  294912      max_pooling2d_3[0][0]
__________________________________________________________________________________________________
norm_6 (BatchNormalization)     (None, 96, 96, 256)  1024        conv_6[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 96, 96, 256)  0           norm_6[0][0]
__________________________________________________________________________________________________
conv_7 (Conv2D)                 (None, 96, 96, 128)  32768       leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
norm_7 (BatchNormalization)     (None, 96, 96, 128)  512         conv_7[0][0]
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 96, 96, 128)  0           norm_7[0][0]
__________________________________________________________________________________________________
conv_8 (Conv2D)                 (None, 96, 96, 256)  294912      leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
norm_8 (BatchNormalization)     (None, 96, 96, 256)  1024        conv_8[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 96, 96, 256)  0           norm_8[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 48, 48, 256)  0           leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
conv_9 (Conv2D)                 (None, 48, 48, 512)  1179648     max_pooling2d_4[0][0]
__________________________________________________________________________________________________
norm_9 (BatchNormalization)     (None, 48, 48, 512)  2048        conv_9[0][0]
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 48, 48, 512)  0           norm_9[0][0]
__________________________________________________________________________________________________
conv_10 (Conv2D)                (None, 48, 48, 256)  131072      leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
norm_10 (BatchNormalization)    (None, 48, 48, 256)  1024        conv_10[0][0]
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 48, 48, 256)  0           norm_10[0][0]
__________________________________________________________________________________________________
conv_11 (Conv2D)                (None, 48, 48, 512)  1179648     leaky_re_lu_10[0][0]
__________________________________________________________________________________________________
norm_11 (BatchNormalization)    (None, 48, 48, 512)  2048        conv_11[0][0]
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 48, 48, 512)  0           norm_11[0][0]
__________________________________________________________________________________________________
conv_12 (Conv2D)                (None, 48, 48, 256)  131072      leaky_re_lu_11[0][0]
__________________________________________________________________________________________________
norm_12 (BatchNormalization)    (None, 48, 48, 256)  1024        conv_12[0][0]
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 48, 48, 256)  0           norm_12[0][0]
__________________________________________________________________________________________________
conv_13 (Conv2D)                (None, 48, 48, 512)  1179648     leaky_re_lu_12[0][0]
__________________________________________________________________________________________________
norm_13 (BatchNormalization)    (None, 48, 48, 512)  2048        conv_13[0][0]
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 48, 48, 512)  0           norm_13[0][0]
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 24, 24, 512)  0           leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
conv_14 (Conv2D)                (None, 24, 24, 1024) 4718592     max_pooling2d_5[0][0]
__________________________________________________________________________________________________
norm_14 (BatchNormalization)    (None, 24, 24, 1024) 4096        conv_14[0][0]
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 24, 24, 1024) 0           norm_14[0][0]
__________________________________________________________________________________________________
conv_15 (Conv2D)                (None, 24, 24, 512)  524288      leaky_re_lu_14[0][0]
__________________________________________________________________________________________________
norm_15 (BatchNormalization)    (None, 24, 24, 512)  2048        conv_15[0][0]
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 24, 24, 512)  0           norm_15[0][0]
__________________________________________________________________________________________________
conv_16 (Conv2D)                (None, 24, 24, 1024) 4718592     leaky_re_lu_15[0][0]
__________________________________________________________________________________________________
norm_16 (BatchNormalization)    (None, 24, 24, 1024) 4096        conv_16[0][0]
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 24, 24, 1024) 0           norm_16[0][0]
__________________________________________________________________________________________________
conv_17 (Conv2D)                (None, 24, 24, 512)  524288      leaky_re_lu_16[0][0]
__________________________________________________________________________________________________
norm_17 (BatchNormalization)    (None, 24, 24, 512)  2048        conv_17[0][0]
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 24, 24, 512)  0           norm_17[0][0]
__________________________________________________________________________________________________
conv_18 (Conv2D)                (None, 24, 24, 1024) 4718592     leaky_re_lu_17[0][0]
__________________________________________________________________________________________________
norm_18 (BatchNormalization)    (None, 24, 24, 1024) 4096        conv_18[0][0]
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 24, 24, 1024) 0           norm_18[0][0]
__________________________________________________________________________________________________
conv_19 (Conv2D)                (None, 24, 24, 1024) 9437184     leaky_re_lu_18[0][0]
__________________________________________________________________________________________________
norm_19 (BatchNormalization)    (None, 24, 24, 1024) 4096        conv_19[0][0]
__________________________________________________________________________________________________
conv_21 (Conv2D)                (None, 48, 48, 64)   32768       leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 24, 24, 1024) 0           norm_19[0][0]
__________________________________________________________________________________________________
norm_21 (BatchNormalization)    (None, 48, 48, 64)   256         conv_21[0][0]
__________________________________________________________________________________________________
conv_20 (Conv2D)                (None, 24, 24, 1024) 9437184     leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 48, 48, 64)   0           norm_21[0][0]
__________________________________________________________________________________________________
norm_20 (BatchNormalization)    (None, 24, 24, 1024) 4096        conv_20[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 24, 24, 256)  0           leaky_re_lu_21[0][0]
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 24, 24, 1024) 0           norm_20[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 24, 24, 1280) 0           lambda_1[0][0]
                                                                 leaky_re_lu_20[0][0]
__________________________________________________________________________________________________
conv_22 (Conv2D)                (None, 24, 24, 1024) 11796480    concatenate_1[0][0]
__________________________________________________________________________________________________
norm_22 (BatchNormalization)    (None, 24, 24, 1024) 4096        conv_22[0][0]
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 24, 24, 1024) 0           norm_22[0][0]
==================================================================================================
Total params: 50,547,936
Trainable params: 50,527,264
Non-trainable params: 20,672
__________________________________________________________________________________________________



Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 768, 768, 3)  0
__________________________________________________________________________________________________
model_1 (Model)                 (None, 24, 24, 1024) 50547936    input_1[0][0]
__________________________________________________________________________________________________
DetectionLayer (Conv2D)         (None, 24, 24, 30)   30750       model_1[1][0]
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 24, 24, 5, 6) 0           DetectionLayer[0][0]
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 1, 1, 1, 10,  0
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 24, 24, 5, 6) 0           reshape_1[0][0]
                                                                 input_2[0][0]
==================================================================================================
Total params: 50,578,686
Trainable params: 50,558,014
Non-trainable params: 20,672
__________________________________________________________________________________________________












Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
the_input (InputLayer)          (None, 128, 64, 1)   0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 128, 64, 128) 1280        the_input[0][0]
__________________________________________________________________________________________________
max1 (MaxPooling2D)             (None, 64, 32, 128)  0           conv1[0][0]
__________________________________________________________________________________________________
conv2 (Conv2D)                  (None, 64, 32, 128)  147584      max1[0][0]
__________________________________________________________________________________________________
conv3 (Conv2D)                  (None, 64, 32, 128)  147584      conv2[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 32, 128)  512         conv3[0][0]
__________________________________________________________________________________________________
max2 (MaxPooling2D)             (None, 32, 16, 128)  0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
reshape (Reshape)               (None, 32, 2048)     0           max2[0][0]
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 32, 128)      262272      reshape[0][0]
__________________________________________________________________________________________________
gru1 (GRU)                      (None, 32, 1024)     3542016     dense1[0][0]
__________________________________________________________________________________________________
gru1_b (GRU)                    (None, 32, 1024)     3542016     dense1[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 1024)     0           gru1[0][0]
                                                                 gru1_b[0][0]
__________________________________________________________________________________________________
gru2 (GRU)                      (None, 32, 1024)     6294528     add_1[0][0]
__________________________________________________________________________________________________
gru2_b (GRU)                    (None, 32, 1024)     6294528     add_1[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 2048)     0           gru2[0][0]
                                                                 gru2_b[0][0]
__________________________________________________________________________________________________
dense2 (Dense)                  (None, 32, 27)       55323       concatenate_1[0][0]
__________________________________________________________________________________________________
softmax (Activation)            (None, 32, 27)       0           dense2[0][0]
==================================================================================================
Total params: 20,287,643
Trainable params: 20,287,387
Non-trainable params: 256
__________________________________________________________________________________________________










































